In [57]:
import numpy as np
import pandas as pd
import random

lista_nomi = ['Paperino','Pippo','Pluto', 'Giovanni', 'Marco']
lista_citta = ['Milano','Napoli','Agrate Brianza','Roma','Torino']

n = 30

nomi_casuali = random.choices(lista_nomi, k=n)
citta_casuali = random.choices(lista_citta, k=n)
salari = np.random.randint(20,100, size = n ).astype(float)
eta = np.random.randint(0,120, size = n)

index_salari = np.random.randint(0,n, size = 3)
for i in index_salari:
    salari[i] = np.nan

df = pd.DataFrame({
    'Nome': nomi_casuali,
    'Città': citta_casuali,
    'Salario in K': salari,
    'Età': eta
})

In [58]:
print(df.head())
print(df.tail())

       Nome           Città  Salario in K  Età
0  Paperino            Roma          95.0  108
1     Marco          Milano          34.0   98
2     Pippo          Milano           NaN   72
3  Paperino          Milano          82.0   42
4     Pluto  Agrate Brianza          60.0  112
        Nome   Città  Salario in K  Età
25     Marco  Milano          54.0   24
26     Pippo  Milano          59.0   86
27  Paperino  Napoli          75.0   25
28     Marco  Napoli          88.0   86
29     Pippo    Roma          62.0   53

In [59]:
df.dtypes

Nome             object
Città            object
Salario in K    float64
Età               int32
dtype: object

In [60]:
media_salario = df['Salario in K'].mean()
media_eta = df['Età'].mean()
mediana_salario = df['Salario in K'].median()
mediana_eta = df['Età'].median()
std_salario = df['Salario in K'].std()
std_eta = df['Età'].std()

print(media_salario,media_eta,mediana_salario,mediana_eta,std_salario,std_eta)

58.2962962962963 61.266666666666666 60.0 58.0 20.323943467316525 34.67278902613078

In [61]:
df_nuovo = df.drop_duplicates()
len(df_nuovo)

30

In [62]:
def categoria_eta(eta):
    if eta < 18:
        return 'Giovane'
    elif 18 <= eta < 66:
        return 'Adulto'
    else:
        return 'Senior'

df_nuovo['Categoria Età'] = df_nuovo['Età'].apply(categoria_eta)

In [63]:
df_nuovo['Salario in K'].fillna(df_nuovo['Salario in K'].median(), inplace= True)
df_nuovo

C:\Users\aless\AppData\Local\Temp\ipykernel_22212\4173331419.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_nuovo['Salario in K'].fillna(df_nuovo['Salario in K'].median(), inplace= True)

        Nome           Città  Salario in K  Età Categoria Età
0   Paperino            Roma          95.0  108        Senior
1      Marco          Milano          34.0   98        Senior
2      Pippo          Milano          60.0   72        Senior
3   Paperino          Milano          82.0   42        Adulto
4      Pluto  Agrate Brianza          60.0  112        Senior
5      Pippo          Milano          20.0   83        Senior
6      Marco            Roma          60.0   85        Senior
7   Giovanni          Milano          35.0   41        Adulto
8      Pippo          Napoli          68.0    0       Giovane
9      Marco          Milano          30.0   32        Adulto
10     Pluto          Milano          37.0   62        Adulto
11     Pippo          Napoli          82.0  103        Senior
12  Giovanni          Torino          40.0   45        Adulto
13  Paperino          Milano          48.0   84        Senior
14     Pippo          Milano          75.0   26        Adulto
15  Giovanni  Agrate Brianza          51.0  103        Senior
16     Marco          Napoli          66.0   18        Adulto
17     Pluto  Agrate Brianza          55.0  117        Senior
18  Paperino          Torino          60.0   54        Adulto
19  Paperino            Roma          72.0   12       Giovane
20  Paperino  Agrate Brianza          76.0   99        Senior
21  Paperino            Roma          46.0   43        Adulto
22     Marco          Napoli          64.0    3       Giovane
23     Pippo          Torino          77.0   68        Senior
24  Giovanni          Torino          23.0   54        Adulto
25     Marco          Milano          54.0   24        Adulto
26     Pippo          Milano          59.0   86        Senior
27  Paperino          Napoli          75.0   25        Adulto
28     Marco          Napoli          88.0   86        Senior
29     Pippo            Roma          62.0   53        Adulto

In [64]:
df_nuovo.to_csv('righe.csv', index=False)

In [65]:
df_nuovo.groupby('Città')['Salario in K'].mean()

Città
Agrate Brianza    60.500000
Milano            48.545455
Napoli            73.833333
Roma              67.000000
Torino            50.000000
Name: Salario in K, dtype: float64

In [67]:
df_pivot = df_nuovo.pivot_table(values ='Salario in K',index ='Nome',columns='Città')
df_pivot

Città     Agrate Brianza     Milano     Napoli  Roma  Torino
Nome
Giovanni            51.0  35.000000        NaN   NaN    31.5
Marco                NaN  39.333333  72.666667  60.0     NaN
Paperino            76.0  65.000000  75.000000  71.0    60.0
Pippo                NaN  53.500000  75.000000  62.0    77.0
Pluto               57.5  37.000000        NaN   NaN     NaN